app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @contacts = Contact.find(params[:id])

INSERT INTO "contacts" ("name", "email", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["email", "test@test.com"], ["comment", "testing"], ["created_at", "2015-12-28 21:50:29.525643"], ["updated_at", "2015-12-28 21:50:29.525643"]]
---
  def create
    @contacts = Contact.new(contact_params)

	if @contacts.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]
---
  def destroy
    @contacts = Contact.find(params[:id])
    @contacts.destroy